HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xd/IfxScuCcu.h
/** \brief MODULE_SCU.PLLCON1.B.K3DIV, specifies the K3-Divider
 */
typedef enum
{
    IfxScuCcu_K3divider_1 = 0,      /**< \brief K3-Divider 1  */
    IfxScuCcu_K3divider_2,          /**< \brief K3-Divider 2  */
    IfxScuCcu_K3divider_3,          /**< \brief K3-Divider 3  */
    IfxScuCcu_K3divider_4,          /**< \brief K3-Divider 4  */
    IfxScuCcu_K3divider_5,          /**< \brief K3-Divider 5  */
    IfxScuCcu_K3divider_6,          /**< \brief K3-Divider 6  */
    IfxScuCcu_K3divider_7,          /**< \brief K3-Divider 7  */
    IfxScuCcu_K3divider_8,          /**< \brief K3-Divider 8  */
    IfxScuCcu_K3divider_9,          /**< \brief K3-Divider 9  */
    IfxScuCcu_K3divider_10,         /**< \brief K3-Divider 10  */
    IfxScuCcu_K3divider_11,         /**< \brief K3-Divider 11  */
    IfxScuCcu_K3divider_12,         /**< \brief K3-Divider 12  */
    IfxScuCcu_K3divider_13,         /**< \brief K3-Divider 13  */
    IfxScuCcu_K3divider_14,         /**< \brief K3-Divider 14  */
    IfxScuCcu_K3divider_15,         /**< \brief K3-Divider 15  */
    IfxScuCcu_K3divider_16,         /**< \brief K3-Divider 16  */
    IfxScuCcu_K3divider_17,         /**< \brief K3-Divider 17  */
    IfxScuCcu_K3divider_18,         /**< \brief K3-Divider 18  */
    IfxScuCcu_K3divider_19,         /**< \brief K3-Divider 19  */
    IfxScuCcu_K3divider_20,         /**< \brief K3-Divider 20  */
    IfxScuCcu_K3divider_21,         /**< \brief K3-Divider 21  */
    IfxScuCcu_K3divider_22,         /**< \brief K3-Divider 22  */
    IfxScuCcu_K3divider_23,         /**< \brief K3-Divider 23  */
    IfxScuCcu_K3divider_24,         /**< \brief K3-Divider 24  */
    IfxScuCcu_K3divider_25,         /**< \brief K3-Divider 25  */
    IfxScuCcu_K3divider_26,         /**< \brief K3-Divider 26  */
    IfxScuCcu_K3divider_27,         /**< \brief K3-Divider 27  */
    IfxScuCcu_K3divider_28,         /**< \brief K3-Divider 28  */
    IfxScuCcu_K3divider_29,         /**< \brief K3-Divider 29  */
    IfxScuCcu_K3divider_30,         /**< \brief K3-Divider 30  */
    IfxScuCcu_K3divider_31,         /**< \brief K3-Divider 31  */
    IfxScuCcu_K3divider_32,         /**< \brief K3-Divider 32  */
    IfxScuCcu_K3divider_33,         /**< \brief K3-Divider 33  */
    IfxScuCcu_K3divider_34,         /**< \brief K3-Divider 34  */
    IfxScuCcu_K3divider_35,         /**< \brief K3-Divider 35  */
    IfxScuCcu_K3divider_36,         /**< \brief K3-Divider 36  */
    IfxScuCcu_K3divider_37,         /**< \brief K3-Divider 37  */
    IfxScuCcu_K3divider_38,         /**< \brief K3-Divider 38  */
    IfxScuCcu_K3divider_39,         /**< \brief K3-Divider 39  */
    IfxScuCcu_K3divider_40,         /**< \brief K3-Divider 40  */
    IfxScuCcu_K3divider_41,         /**< \brief K3-Divider 41  */
    IfxScuCcu_K3divider_42,         /**< \brief K3-Divider 42  */
    IfxScuCcu_K3divider_43,         /**< \brief K3-Divider 43  */
    IfxScuCcu_K3divider_44,         /**< \brief K3-Divider 44  */
    IfxScuCcu_K3divider_45,         /**< \brief K3-Divider 45  */
    IfxScuCcu_K3divider_46,         /**< \brief K3-Divider 46  */
    IfxScuCcu_K3divider_47,         /**< \brief K3-Divider 47  */
    IfxScuCcu_K3divider_48,         /**< \brief K3-Divider 48  */
    IfxScuCcu_K3divider_49,         /**< \brief K3-Divider 49  */
    IfxScuCcu_K3divider_50,         /**< \brief K3-Divider 50  */
    IfxScuCcu_K3divider_51,         /**< \brief K3-Divider 51  */
    IfxScuCcu_K3divider_52,         /**< \brief K3-Divider 52  */
    IfxScuCcu_K3divider_53,         /**< \brief K3-Divider 53  */
    IfxScuCcu_K3divider_54,         /**< \brief K3-Divider 54  */
    IfxScuCcu_K3divider_55,         /**< \brief K3-Divider 55  */
    IfxScuCcu_K3divider_56,         /**< \brief K3-Divider 56  */
    IfxScuCcu_K3divider_57,         /**< \brief K3-Divider 57  */
    IfxScuCcu_K3divider_58,         /**< \brief K3-Divider 58  */
    IfxScuCcu_K3divider_59,         /**< \brief K3-Divider 59  */
    IfxScuCcu_K3divider_60,         /**< \brief K3-Divider 60  */
    IfxScuCcu_K3divider_61,         /**< \brief K3-Divider 61  */
    IfxScuCcu_K3divider_62,         /**< \brief K3-Divider 62  */
    IfxScuCcu_K3divider_63,         /**< \brief K3-Divider 63  */
    IfxScuCcu_K3divider_64,         /**< \brief K3-Divider 64  */
    IfxScuCcu_K3divider_65,         /**< \brief K3-Divider 65  */
    IfxScuCcu_K3divider_66,         /**< \brief K3-Divider 66  */
    IfxScuCcu_K3divider_67,         /**< \brief K3-Divider 67  */
    IfxScuCcu_K3divider_68,         /**< \brief K3-Divider 68  */
    IfxScuCcu_K3divider_69,         /**< \brief K3-Divider 69  */
    IfxScuCcu_K3divider_70,         /**< \brief K3-Divider 70  */
    IfxScuCcu_K3divider_71,         /**< \brief K3-Divider 71  */
    IfxScuCcu_K3divider_72,         /**< \brief K3-Divider 72  */
    IfxScuCcu_K3divider_73,         /**< \brief K3-Divider 73  */
    IfxScuCcu_K3divider_74,         /**< \brief K3-Divider 74  */
    IfxScuCcu_K3divider_75,         /**< \brief K3-Divider 75  */
    IfxScuCcu_K3divider_76,         /**< \brief K3-Divider 76  */
    IfxScuCcu_K3divider_77,         /**< \brief K3-Divider 77  */
    IfxScuCcu_K3divider_78,         /**< \brief K3-Divider 78  */
    IfxScuCcu_K3divider_79,         /**< \brief K3-Divider 79  */
    IfxScuCcu_K3divider_80,         /**< \brief K3-Divider 80  */
    IfxScuCcu_K3divider_81,         /**< \brief K3-Divider 81  */
    IfxScuCcu_K3divider_82,         /**< \brief K3-Divider 82  */
    IfxScuCcu_K3divider_83,         /**< \brief K3-Divider 83  */
    IfxScuCcu_K3divider_84,         /**< \brief K3-Divider 84  */
    IfxScuCcu_K3divider_85,         /**< \brief K3-Divider 85  */
    IfxScuCcu_K3divider_86,         /**< \brief K3-Divider 86  */
    IfxScuCcu_K3divider_87,         /**< \brief K3-Divider 87  */
    IfxScuCcu_K3divider_88,         /**< \brief K3-Divider 88  */
    IfxScuCcu_K3divider_89,         /**< \brief K3-Divider 89  */
    IfxScuCcu_K3divider_90,         /**< \brief K3-Divider 90  */
    IfxScuCcu_K3divider_91,         /**< \brief K3-Divider 91  */
    IfxScuCcu_K3divider_92,         /**< \brief K3-Divider 92  */
    IfxScuCcu_K3divider_93,         /**< \brief K3-Divider 93  */
    IfxScuCcu_K3divider_94,         /**< \brief K3-Divider 94  */
    IfxScuCcu_K3divider_95,         /**< \brief K3-Divider 95  */
    IfxScuCcu_K3divider_96,         /**< \brief K3-Divider 96  */
    IfxScuCcu_K3divider_97,         /**< \brief K3-Divider 97  */
    IfxScuCcu_K3divider_98,         /**< \brief K3-Divider 98  */
    IfxScuCcu_K3divider_99,         /**< \brief K3-Divider 99  */
    IfxScuCcu_K3divider_100,        /**< \brief K3-Divider 100  */
    IfxScuCcu_K3divider_101,        /**< \brief K3-Divider 101  */
    IfxScuCcu_K3divider_102,        /**< \brief K3-Divider 102  */
    IfxScuCcu_K3divider_103,        /**< \brief K3-Divider 103  */
    IfxScuCcu_K3divider_104,        /**< \brief K3-Divider 104  */
    IfxScuCcu_K3divider_105,        /**< \brief K3-Divider 105  */
    IfxScuCcu_K3divider_106,        /**< \brief K3-Divider 106  */
    IfxScuCcu_K3divider_107,        /**< \brief K3-Divider 107  */
    IfxScuCcu_K3divider_108,        /**< \brief K3-Divider 108  */
    IfxScuCcu_K3divider_109,        /**< \brief K3-Divider 109  */
    IfxScuCcu_K3divider_110,        /**< \brief K3-Divider 110  */
    IfxScuCcu_K3divider_111,        /**< \brief K3-Divider 111  */
    IfxScuCcu_K3divider_112,        /**< \brief K3-Divider 112  */
    IfxScuCcu_K3divider_113,        /**< \brief K3-Divider 113  */
    IfxScuCcu_K3divider_114,        /**< \brief K3-Divider 114  */
    IfxScuCcu_K3divider_115,        /**< \brief K3-Divider 115  */
    IfxScuCcu_K3divider_116,        /**< \brief K3-Divider 116  */
    IfxScuCcu_K3divider_117,        /**< \brief K3-Divider 117  */
    IfxScuCcu_K3divider_118,        /**< \brief K3-Divider 118  */
    IfxScuCcu_K3divider_119,        /**< \brief K3-Divider 119  */
    IfxScuCcu_K3divider_120,        /**< \brief K3-Divider 120  */
    IfxScuCcu_K3divider_121,        /**< \brief K3-Divider 121  */
    IfxScuCcu_K3divider_122,        /**< \brief K3-Divider 122  */
    IfxScuCcu_K3divider_123,        /**< \brief K3-Divider 123  */
    IfxScuCcu_K3divider_124,        /**< \brief K3-Divider 124  */
    IfxScuCcu_K3divider_125,        /**< \brief K3-Divider 125  */
    IfxScuCcu_K3divider_126,        /**< \brief K3-Divider 126  */
    IfxScuCcu_K3divider_127,        /**< \brief K3-Divider 127  */
    IfxScuCcu_K3divider_128         /**< \brief K3-Divider 128  */
} IfxScuCcu_K3divider;

/** \brief MODULE_SCU.PLLCON0.B.NDIV, specifies the N-Divider
 */
typedef enum
{
    IfxScuCcu_Ndivider_1 = 0,      /**< \brief  N-divider 1  */
    IfxScuCcu_Ndivider_2,          /**< \brief  N-divider 2  */
    IfxScuCcu_Ndivider_3,          /**< \brief  N-divider 3  */
    IfxScuCcu_Ndivider_4,          /**< \brief  N-divider 4  */
    IfxScuCcu_Ndivider_5,          /**< \brief  N-divider 5  */
    IfxScuCcu_Ndivider_6,          /**< \brief  N-divider 6  */
    IfxScuCcu_Ndivider_7,          /**< \brief  N-divider 7  */
    IfxScuCcu_Ndivider_8,          /**< \brief  N-divider 8  */
    IfxScuCcu_Ndivider_9,          /**< \brief  N-divider 9  */
    IfxScuCcu_Ndivider_10,         /**< \brief  N-divider 10  */
    IfxScuCcu_Ndivider_11,         /**< \brief  N-divider 11  */
    IfxScuCcu_Ndivider_12,         /**< \brief  N-divider 12  */
    IfxScuCcu_Ndivider_13,         /**< \brief  N-divider 13  */
    IfxScuCcu_Ndivider_14,         /**< \brief  N-divider 14  */
    IfxScuCcu_Ndivider_15,         /**< \brief  N-divider 15  */
    IfxScuCcu_Ndivider_16,         /**< \brief  N-divider 16  */
    IfxScuCcu_Ndivider_17,         /**< \brief  N-divider 17  */
    IfxScuCcu_Ndivider_18,         /**< \brief  N-divider 18  */
    IfxScuCcu_Ndivider_19,         /**< \brief  N-divider 19  */
    IfxScuCcu_Ndivider_20,         /**< \brief  N-divider 20  */
    IfxScuCcu_Ndivider_21,         /**< \brief  N-divider 21  */
    IfxScuCcu_Ndivider_22,         /**< \brief  N-divider 22  */
    IfxScuCcu_Ndivider_23,         /**< \brief  N-divider 23  */
    IfxScuCcu_Ndivider_24,         /**< \brief  N-divider 24  */
    IfxScuCcu_Ndivider_25,         /**< \brief  N-divider 25  */
    IfxScuCcu_Ndivider_26,         /**< \brief  N-divider 26  */
    IfxScuCcu_Ndivider_27,         /**< \brief  N-divider 27  */
    IfxScuCcu_Ndivider_28,         /**< \brief  N-divider 28  */
    IfxScuCcu_Ndivider_29,         /**< \brief  N-divider 29  */
    IfxScuCcu_Ndivider_30,         /**< \brief  N-divider 30  */
    IfxScuCcu_Ndivider_31,         /**< \brief  N-divider 31  */
    IfxScuCcu_Ndivider_32,         /**< \brief  N-divider 32  */
    IfxScuCcu_Ndivider_33,         /**< \brief  N-divider 33  */
    IfxScuCcu_Ndivider_34,         /**< \brief  N-divider 34  */
    IfxScuCcu_Ndivider_35,         /**< \brief  N-divider 35  */
    IfxScuCcu_Ndivider_36,         /**< \brief  N-divider 36  */
    IfxScuCcu_Ndivider_37,         /**< \brief  N-divider 37  */
    IfxScuCcu_Ndivider_38,         /**< \brief  N-divider 38  */
    IfxScuCcu_Ndivider_39,         /**< \brief  N-divider 39  */
    IfxScuCcu_Ndivider_40,         /**< \brief  N-divider 40  */
    IfxScuCcu_Ndivider_41,         /**< \brief  N-divider 41  */
    IfxScuCcu_Ndivider_42,         /**< \brief  N-divider 42  */
    IfxScuCcu_Ndivider_43,         /**< \brief  N-divider 43  */
    IfxScuCcu_Ndivider_44,         /**< \brief  N-divider 44  */
    IfxScuCcu_Ndivider_45,         /**< \brief  N-divider 45  */
    IfxScuCcu_Ndivider_46,         /**< \brief  N-divider 46  */
    IfxScuCcu_Ndivider_47,         /**< \brief  N-divider 47  */
    IfxScuCcu_Ndivider_48,         /**< \brief  N-divider 48  */
    IfxScuCcu_Ndivider_49,         /**< \brief  N-divider 49  */
    IfxScuCcu_Ndivider_50,         /**< \brief  N-divider 50  */
    IfxScuCcu_Ndivider_51,         /**< \brief  N-divider 51  */
    IfxScuCcu_Ndivider_52,         /**< \brief  N-divider 52  */
    IfxScuCcu_Ndivider_53,         /**< \brief  N-divider 53  */
    IfxScuCcu_Ndivider_54,         /**< \brief  N-divider 54  */
    IfxScuCcu_Ndivider_55,         /**< \brief  N-divider 55  */
    IfxScuCcu_Ndivider_56,         /**< \brief  N-divider 56  */
    IfxScuCcu_Ndivider_57,         /**< \brief  N-divider 57  */
    IfxScuCcu_Ndivider_58,         /**< \brief  N-divider 58  */
    IfxScuCcu_Ndivider_59,         /**< \brief  N-divider 59  */
    IfxScuCcu_Ndivider_60,         /**< \brief  N-divider 60  */
    IfxScuCcu_Ndivider_61,         /**< \brief  N-divider 61  */
    IfxScuCcu_Ndivider_62,         /**< \brief  N-divider 62  */
    IfxScuCcu_Ndivider_63,         /**< \brief  N-divider 63  */
    IfxScuCcu_Ndivider_64,         /**< \brief  N-divider 64  */
    IfxScuCcu_Ndivider_65,         /**< \brief  N-divider 65  */
    IfxScuCcu_Ndivider_66,         /**< \brief  N-divider 66  */
    IfxScuCcu_Ndivider_67,         /**< \brief  N-divider 67  */
    IfxScuCcu_Ndivider_68,         /**< \brief  N-divider 68  */
    IfxScuCcu_Ndivider_69,         /**< \brief  N-divider 69  */
    IfxScuCcu_Ndivider_70,         /**< \brief  N-divider 70  */
    IfxScuCcu_Ndivider_71,         /**< \brief  N-divider 71  */
    IfxScuCcu_Ndivider_72,         /**< \brief  N-divider 72  */
    IfxScuCcu_Ndivider_73,         /**< \brief  N-divider 73  */
    IfxScuCcu_Ndivider_74,         /**< \brief  N-divider 74  */
    IfxScuCcu_Ndivider_75,         /**< \brief  N-divider 75  */
    IfxScuCcu_Ndivider_76,         /**< \brief  N-divider 76  */
    IfxScuCcu_Ndivider_77,         /**< \brief  N-divider 77  */
    IfxScuCcu_Ndivider_78,         /**< \brief  N-divider 78  */
    IfxScuCcu_Ndivider_79,         /**< \brief  N-divider 79  */
    IfxScuCcu_Ndivider_80,         /**< \brief  N-divider 80  */
    IfxScuCcu_Ndivider_81,         /**< \brief  N-divider 81  */
    IfxScuCcu_Ndivider_82,         /**< \brief  N-divider 82  */
    IfxScuCcu_Ndivider_83,         /**< \brief  N-divider 83  */
    IfxScuCcu_Ndivider_84,         /**< \brief  N-divider 84  */
    IfxScuCcu_Ndivider_85,         /**< \brief  N-divider 85  */
    IfxScuCcu_Ndivider_86,         /**< \brief  N-divider 86  */
    IfxScuCcu_Ndivider_87,         /**< \brief  N-divider 87  */
    IfxScuCcu_Ndivider_88,         /**< \brief  N-divider 88  */
    IfxScuCcu_Ndivider_89,         /**< \brief  N-divider 89  */
    IfxScuCcu_Ndivider_90,         /**< \brief  N-divider 90  */
    IfxScuCcu_Ndivider_91,         /**< \brief  N-divider 91  */
    IfxScuCcu_Ndivider_92,         /**< \brief  N-divider 92  */
    IfxScuCcu_Ndivider_93,         /**< \brief  N-divider 93  */
    IfxScuCcu_Ndivider_94,         /**< \brief  N-divider 94  */
    IfxScuCcu_Ndivider_95,         /**< \brief  N-divider 95  */
    IfxScuCcu_Ndivider_96,         /**< \brief  N-divider 96  */
    IfxScuCcu_Ndivider_97,         /**< \brief  N-divider 97  */
    IfxScuCcu_Ndivider_98,         /**< \brief  N-divider 98  */
    IfxScuCcu_Ndivider_99,         /**< \brief  N-divider 99  */
    IfxScuCcu_Ndivider_100,        /**< \brief  N-divider 100  */
    IfxScuCcu_Ndivider_101,        /**< \brief  N-divider 101  */
    IfxScuCcu_Ndivider_102,        /**< \brief  N-divider 102  */
    IfxScuCcu_Ndivider_103,        /**< \brief  N-divider 103  */
    IfxScuCcu_Ndivider_104,        /**< \brief  N-divider 104  */
    IfxScuCcu_Ndivider_105,        /**< \brief  N-divider 105  */
    IfxScuCcu_Ndivider_106,        /**< \brief  N-divider 106  */
    IfxScuCcu_Ndivider_107,        /**< \brief  N-divider 107  */
    IfxScuCcu_Ndivider_108,        /**< \brief  N-divider 108  */
    IfxScuCcu_Ndivider_109,        /**< \brief  N-divider 109  */
    IfxScuCcu_Ndivider_110,        /**< \brief  N-divider 110  */
    IfxScuCcu_Ndivider_111,        /**< \brief  N-divider 111  */
    IfxScuCcu_Ndivider_112,        /**< \brief  N-divider 112  */
    IfxScuCcu_Ndivider_113,        /**< \brief  N-divider 113  */
    IfxScuCcu_Ndivider_114,        /**< \brief  N-divider 114  */
    IfxScuCcu_Ndivider_115,        /**< \brief  N-divider 115  */
    IfxScuCcu_Ndivider_116,        /**< \brief  N-divider 116  */
    IfxScuCcu_Ndivider_117,        /**< \brief  N-divider 117  */
    IfxScuCcu_Ndivider_118,        /**< \brief  N-divider 118  */
    IfxScuCcu_Ndivider_119,        /**< \brief  N-divider 119  */
    IfxScuCcu_Ndivider_120,        /**< \brief  N-divider 120  */
    IfxScuCcu_Ndivider_121,        /**< \brief  N-divider 121  */
    IfxScuCcu_Ndivider_122,        /**< \brief  N-divider 122  */
    IfxScuCcu_Ndivider_123,        /**< \brief  N-divider 123  */
    IfxScuCcu_Ndivider_124,        /**< \brief  N-divider 124  */
    IfxScuCcu_Ndivider_125,        /**< \brief  N-divider 125  */
    IfxScuCcu_Ndivider_126,        /**< \brief  N-divider 126  */
    IfxScuCcu_Ndivider_127,        /**< \brief  N-divider 127  */
    IfxScuCcu_Ndivider_128         /**< \brief  N-divider 128  */
} IfxScuCcu_Ndivider;

/** \brief MODULE_SCU.PLLCON0.B.PDIV, specifies the P-Divider
 */
typedef enum
{
    IfxScuCcu_Pdivider_1 = 0,      /**< \brief  P-divider 1  */
    IfxScuCcu_Pdivider_2,          /**< \brief  P-divider 2  */
    IfxScuCcu_Pdivider_3,          /**< \brief  P-divider 3  */
    IfxScuCcu_Pdivider_4,          /**< \brief  P-divider 4  */
    IfxScuCcu_Pdivider_5,          /**< \brief  P-divider 5  */
    IfxScuCcu_Pdivider_6,          /**< \brief  P-divider 6  */
    IfxScuCcu_Pdivider_7,          /**< \brief  P-divider 7  */
    IfxScuCcu_Pdivider_8,          /**< \brief  P-divider 8  */
    IfxScuCcu_Pdivider_9,          /**< \brief  P-divider 9  */
    IfxScuCcu_Pdivider_10,         /**< \brief  P-divider 10  */
    IfxScuCcu_Pdivider_11,         /**< \brief  P-divider 11  */
    IfxScuCcu_Pdivider_12,         /**< \brief  P-divider 12  */
    IfxScuCcu_Pdivider_13,         /**< \brief  P-divider 13  */
    IfxScuCcu_Pdivider_14,         /**< \brief  P-divider 14  */
    IfxScuCcu_Pdivider_15,         /**< \brief  P-divider 15  */
    IfxScuCcu_Pdivider_16          /**< \brief  P-divider 16  */
} IfxScuCcu_Pdivider;

