HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xd/IfxScuCcu.h
/** \} */

/** \brief divider mode selection for EXTCLK0
 */
typedef enum
{
    IfxScuCcu_Clk0Mode_normal     = 1, /**< \brief Select normal mode */
    IfxScuCcu_Clk0Mode_fractional = 2  /**< \brief Select fractional mode */
} IfxScuCcu_Clk0Mode;

/** \brief clock line negation selection for EXTCLK1
 */
typedef enum
{
    IfxScuCcu_Clk1Negation_inverted     = 0, /**< \brief Select inverted signal for EXTCLK1 */
    IfxScuCcu_Clk1Negation_Clk1Negation = 1  /**< \brief Select non inverted signal for EXTCLK1 */
} IfxScuCcu_Clk1Negation;

/** \brief External Clock Selection for EXTCLK0
 */
typedef enum
{
    IfxScuCcu_ClkSel0_fOUT     = 0,  /**< \brief Select fOUT as EXTCLK0 */
    IfxScuCcu_ClkSel0_fPLL     = 1,  /**< \brief Select fPLL as EXTCLK0 */
    IfxScuCcu_ClkSel0_fPLLERAY = 2,  /**< \brief Select fPLLERAY as EXTCLK0 */
    IfxScuCcu_ClkSel0_fOSC0    = 3,  /**< \brief Select fOSC0 as EXTCLK0 */
    IfxScuCcu_ClkSel0_fBACK    = 4,  /**< \brief Select fBACK as EXTCLK0 */
    IfxScuCcu_ClkSel0_fETH     = 5,  /**< \brief Select fETH as EXTCLK0 */
    IfxScuCcu_ClkSel0_fBBB     = 6,  /**< \brief Select fBBB as EXTCLK0 */
    IfxScuCcu_ClkSel0_fBAUD1   = 7,  /**< \brief Select fBAUD1 as EXTCLK0 */
    IfxScuCcu_ClkSel0_fSRI     = 8,  /**< \brief Select fSRI as EXTCLK0 */
    IfxScuCcu_ClkSel0_fSPB     = 9,  /**< \brief Select fSPB as EXTCLK0 */
    IfxScuCcu_ClkSel0_fFSI     = 10, /**< \brief Select fFSI as EXTCLK0 */
    IfxScuCcu_ClkSel0_fSTM     = 11, /**< \brief Select fSTM as EXTCLK0 */
    IfxScuCcu_ClkSel0_fGTM     = 12, /**< \brief Select fGTM as EXTCLK0 */
    IfxScuCcu_ClkSel0_fTCK     = 13, /**< \brief Select fTCK as EXTCLK0 */
    IfxScuCcu_ClkSel0_fBAUD2   = 14, /**< \brief Select fBAUD2 as EXTCLK0 */
    IfxScuCcu_ClkSel0_fMT0     = 15  /**< \brief Select fMT0 as EXTCLK0 */
} IfxScuCcu_ClkSel0;

/** \brief External Clock Selection for EXTCLK1
 */
typedef enum
{
    IfxScuCcu_ClkSel1_fOUT     = 0,   /**< \brief Select fOUT as EXTCLK1 */
    IfxScuCcu_ClkSel1_fPLL     = 1,   /**< \brief Select fPLL as EXTCLK1 */
    IfxScuCcu_ClkSel1_fPLLERAY = 2,   /**< \brief Select fPLLERAY as EXTCLK1 */
    IfxScuCcu_ClkSel1_fOSC0    = 3,   /**< \brief Select fOSC0 as EXTCLK1 */
    IfxScuCcu_ClkSel1_fBACK    = 4,   /**< \brief Select fBACK as EXTCLK1 */
    IfxScuCcu_ClkSel1_fETH     = 5,   /**< \brief Select fETH as EXTCLK1 */
    IfxScuCcu_ClkSel1_fBBB     = 6,   /**< \brief Select fBBB as EXTCLK1 */
    IfxScuCcu_ClkSel1_fASLINF  = 7,   /**< \brief Select fASLINF as EXTCLK1 */
    IfxScuCcu_ClkSel1_fSRI     = 8,   /**< \brief Select fSRI as EXTCLK1 */
    IfxScuCcu_ClkSel1_fSPB     = 9,   /**< \brief Select fSPB as EXTCLK1 */
    IfxScuCcu_ClkSel1_fFSI2    = 10,  /**< \brief Select fFSI2 as EXTCLK1 */
    IfxScuCcu_ClkSel1_fCAN     = 11,  /**< \brief Select fCAN as EXTCLK1 */
    IfxScuCcu_ClkSel1_fERAY    = 12,  /**< \brief Select fERAY as EXTCLK1 */
    IfxScuCcu_ClkSel1_fTCK     = 13,  /**< \brief Select fTCK as EXTCLK1 */
    IfxScuCcu_ClkSel1_fASCLINS = 14,  /**< \brief Select fASCLINS as EXTCLK1 */
    IfxScuCcu_ClkSel1_fOSCFL   = 15   /**< \brief Select ffOSCFL as EXTCLK1 */
} IfxScuCcu_ClkSel1;

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Scu_Std_Ccu_Ccu
 * \{ */
/** \brief Configuration structure type for CCUCON registers.
 */
typedef struct
{
    uint32 value;       /**< \brief CCUCON Register value to be updated. */
    uint32 mask;        /**< \brief CCUCON Mask to select the bit fields to be updated. */
} IfxScuCcu_CcuconRegConfig;

/** \brief Configuration structure type for the Pll initial step.
 * This structure must be used to configure the P, N and K2 dividers for initial step.
 */
typedef struct
{
    uint8   pDivider;        /**< \brief P divider value for basic (initial) step */
    uint8   nDivider;        /**< \brief N divider value for basic (initial) step */
    uint8   k2Initial;       /**< \brief K2 divider value for basic (initial) step */
    float32 waitTime;        /**< \brief Wait time for for basic (initial) step */
} IfxScuCcu_InitialStepConfig;

/** \brief Configuration structure type for the Pll Steps for current jump control.
 */
typedef struct
{
    uint8                          k2Step;             /**< \brief K2 divider value for this step. */
    float32                        waitTime;           /**< \brief Wait time for for this step. */
    IfxScuCcu_PllStepsFunctionHook hookFunction;       /**< \brief Hook function called at the end of this step. */
} IfxScuCcu_PllStepsConfig;

/** \} */

/** \addtogroup IfxLld_Scu_Std_Ccu_Ccu
 * \{ */
/** \brief Configuration structure type for all the CCUCON registers to configure clock distribution.
 */
typedef struct
{
    IfxScuCcu_CcuconRegConfig ccucon0;       /**< \brief CCUCON0 Register configuration */
    IfxScuCcu_CcuconRegConfig ccucon1;       /**< \brief CCUCON1 Register configuration */
    IfxScuCcu_CcuconRegConfig ccucon2;       /**< \brief CCUCON2 Register configuration */
    IfxScuCcu_CcuconRegConfig ccucon5;       /**< \brief CCUCON5 Register configuration */
    IfxScuCcu_CcuconRegConfig ccucon6;       /**< \brief CCUCON6 Register configuration */
    IfxScuCcu_CcuconRegConfig ccucon7;       /**< \brief CCUCON7 Register configuration */
    IfxScuCcu_CcuconRegConfig ccucon8;       /**< \brief CCUCON8 Register configuration */
} IfxScuCcu_ClockDistributionConfig;

/** \brief Configuration structure type for the Flash waitstate configuration.
 */
typedef struct
{
    uint32 value;       /**< \brief FLASH.FCON Register value to be updated. */
    uint32 mask;        /**< \brief FLASH.FCON Mask to select the bit fields to be updated. */
} IfxScuCcu_FlashWaitstateConfig;

/** \brief Configuration structure type for the System Pll step.
 * This structure must be used to configure the P, N and K1 dividers .
 */
typedef struct
{
    uint8                       numOfPllDividerSteps;       /**< \brief Number of PLL divider steps during clock throttling. */
    IfxScuCcu_PllStepsConfig   *pllDividerStep;             /**< \brief Pointer to the array of Pll divider step configuration. */
    IfxScuCcu_InitialStepConfig pllInitialStep;             /**< \brief Configuration of first step which is same as internal osc frequency. */
} IfxScuCcu_SysPllConfig;

